zpq001/mdr32f9q-ps200w/src/converter.c
/********************************************************************
	Module		Converter
	
	Purpose:
		
					
	Globals used:

		
	Operation: FIXME

********************************************************************/

#include "MDR32Fx.h" 
#include "MDR32F9Qx_port.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "systemfunc.h"
#include "led.h"
#include "adc.h"
#include "defines.h"
#include "control.h"
#include "converter.h"
#include "sound_driver.h"

#include "guiTop.h"


// Globals used for communicating with converter control task called from ISR
volatile uint8_t state_HWProcess = STATE_HW_OFF;	
volatile uint8_t ctrl_HWProcess = 0;

volatile uint8_t cmd_ADC_to_HWProcess = 0;


static uint32_t gui_msg;


converter_regulation_t channel_5v;
converter_regulation_t channel_12v;
converter_regulation_t *regulation_setting_p;







const conveter_message_t converter_tick_message = 	{	CONVERTER_TICK, 0, 0 };
const conveter_message_t converter_update_message = {	CONVERTER_UPDATE, 0, 0 };
//const conveter_message_t converter_init_message = {	CONVERTER_INITIALIZE, 0, 0 };


xQueueHandle xQueueConverter;


static void apply_regulation(void);
static uint16_t CheckSetVoltageRange(int32_t new_set_voltage, uint8_t *err_code);
static uint16_t CheckSetCurrentRange(int32_t new_set_current, uint8_t *err_code);






uint32_t conv_state = CONV_OFF;




static uint16_t CheckSetVoltageRange(int32_t new_set_voltage, uint8_t *err_code)
{
	uint8_t error = VCHECK_OK;

	// First check soft limits
	if (regulation_setting_p->soft_voltage_range_enable)
	{
		if (new_set_voltage <= (int32_t)regulation_setting_p->soft_min_voltage)
		{
			new_set_voltage = (int32_t)regulation_setting_p->soft_min_voltage;
			error = VCHECK_SOFT_MIN;
		}
		else if (new_set_voltage >= (int32_t)regulation_setting_p->soft_max_voltage)
		{
			new_set_voltage = (int32_t)regulation_setting_p->soft_max_voltage;
			error = VCHECK_SOFT_MAX;
		}
	}
	
	// Check absolute limits
	if (new_set_voltage <= (int32_t)regulation_setting_p->MIN_VOLTAGE)
	{
		new_set_voltage = (int32_t)regulation_setting_p->MIN_VOLTAGE;
		error = VCHECK_ABS_MIN;
	}
	else if (new_set_voltage >= (int32_t)regulation_setting_p->MAX_VOLTAGE)
	{
		new_set_voltage = (int32_t)regulation_setting_p->MAX_VOLTAGE;
		error = VCHECK_ABS_MAX;
	}
	
	if (err_code)
		*err_code = error;
	return (uint16_t)new_set_voltage;
}


static uint16_t CheckSetCurrentRange(int32_t new_set_current, uint8_t *err_code)
{
	int32_t max_current;
	int32_t min_current;	
	uint8_t error = CCHECK_OK;
	
	if (regulation_setting_p->current_limit == CURRENT_LIM_HIGH)
	{
		max_current = regulation_setting_p->HIGH_LIM_MAX_CURRENT;
		min_current = regulation_setting_p->HIGH_LIM_MIN_CURRENT;
	}
	else
	{
		max_current = regulation_setting_p->LOW_LIM_MAX_CURRENT;
		min_current = regulation_setting_p->LOW_LIM_MIN_CURRENT;
	}
	
	// First check soft limits
	if (regulation_setting_p->soft_current_range_enable)
	{
		if (new_set_current <= (int32_t)regulation_setting_p->soft_min_current)
		{
			new_set_current = (int32_t)regulation_setting_p->soft_min_current;
			error = CCHECK_SOFT_MIN;
		}
		else if (new_set_current >= (int32_t)regulation_setting_p->soft_max_current)
		{
			new_set_current = (int32_t)regulation_setting_p->soft_max_current;
			error = CCHECK_SOFT_MAX;
		}	
	}
	
	// Check absolute limits - this will overwrite possibly incorrect soft limits
	// This can happen for exapmle, if soft_min = 35A and current limit is switched to 20A
	if (new_set_current <= min_current)
	{
		new_set_current = min_current;
		error = CCHECK_ABS_MIN;
	}
	else if (new_set_current >= max_current)
	{
		new_set_current = max_current;
		error = CCHECK_ABS_MAX;
	}
	
	if (err_code)
		*err_code = error;
	return (uint16_t)new_set_current;
}





uint8_t Converter_SetVoltageLimit(uint8_t type, int32_t value, uint8_t enable)
{
	uint8_t error = 0;
	
	// Bound limit
	if (value <= regulation_setting_p->voltage.LIMIT_MIN)
	{
		value = regulation_setting_p->voltage.LIMIT_MIN;
		error = 1;
	}
	if (value >= regulation_setting_p->voltage.LIMIT_MAX)
	{
		value = regulation_setting_p->voltage.LIMIT_MAX;
		error = 1;
	}
	
	if (type == 0)
	{
		// Low limit
		regulation_setting_p->voltage.limit_low = (uint16_t) value;
		regulation_setting_p->voltage.enable_low_limit = enable;
	}
	else
	{
		// High limit
		regulation_setting_p->voltage.limit_high = (uint16_t) value;
		regulation_setting_p->voltage.enable_low_high = enable;
	}
	
	return error;
}

/*

uint8_t Converter_SetSoftLimit(int32_t new_limit, converter_regulation_t *reg_p, uint8_t mode)
{
	uint8_t err_code = SLIM_OK;
	uint16_t *lim_p;
	int32_t minimum;
	int32_t maximum;
	
	switch (mode)
	{
		case SET_LOW_CURRENT_SOFT_LIMIT:
			lim_p = &reg_p->soft_min_current;
			minimum = reg_p->SOFT_MIN_CURRENT_LIMIT;
			maximum = reg_p->soft_max_current;
			break;
		case SET_HIGH_CURRENT_SOFT_LIMIT:
			lim_p = &reg_p->soft_max_current;
			minimum = reg_p->soft_min_current;
			maximum = reg_p->SOFT_MAX_CURRENT_LIMIT;
			break;
		case SET_LOW_VOLTAGE_SOFT_LIMIT:
			lim_p = &reg_p->soft_min_voltage;
			minimum = reg_p->SOFT_MIN_VOLTAGE_LIMIT;
			maximum = reg_p->soft_max_voltage;
			break;
		default: // SET_HIGH_VOLTAGE_SOFT_LIMIT:
			lim_p = &reg_p->soft_max_voltage;
			minimum = reg_p->soft_min_voltage;
			maximum = reg_p->SOFT_MAX_VOLTAGE_LIMIT;
			break;
	}
	
	if (new_limit < minimum)
	{
		new_limit = minimum;
		err_code = SLIM_MIN;
	}
	if (new_limit > maximum)	// MAX has greater priority
	{
		new_limit = maximum;
		err_code = SLIM_MAX;
	}
	*lim_p = (uint16_t)new_limit;
	
	return err_code;
}
*/

static void apply_regulation(void)
{
	uint16_t temp;
	
	// Apply voltage - same for both 5V and 12V channels
	temp = regulation_setting_p -> set_voltage;
	temp /= 5;
	SetVoltagePWMPeriod(temp);		// FIXME - we are setting not period but duty
	
	// Apply current different for 20A and 40A limits
	temp = regulation_setting_p -> set_current;
	temp = (regulation_setting_p -> current_limit == CURRENT_LIM_HIGH) ? temp / 2 : temp;
	temp /= 5;
	SetCurrentPWMPeriod(temp);		// FIXME - we are setting not period but duty
}





// TODO: add regulation of overload parameters - different for each channel or common for both ?

void Converter_Init(uint8_t default_channel)
{
	// Converter is powered off.
	// TODO: add restore from EEPROM
	
	//---------- Channel 5V ------------//
	
	// Common
	channel_5v.CHANNEL = CHANNEL_5V;
	channel_5v.load_state = LOAD_ENABLE;										// dummy - load at 5V channel can not be disabled
	channel_5v.overload_protection_enable = 1;									// TODO: EEPROM
	channel_5v.overload_timeout = 1;											// TODO: EEPROM
	
	// Voltage
	channel_5v.voltage.setting = 5000;											// TODO: EEPROM
	channel_5v.voltage.MINIMUM = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage setting for channel
	channel_5v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage setting for channel
	channel_5v.voltage.limit_low = CONV_MIN_VOLTAGE_5V_CHANNEL;					// TODO: EEPROM
	channel_5v.voltage.limit_high = CONV_MAX_VOLTAGE_5V_CHANNEL;				// TODO: EEPROM
	channel_5v.VOLTAGE.LIMIT_MIN = CONV_MIN_VOLTAGE_5V_CHANNEL;					// Minimum voltage limit setting
	channel_5v.VOLTAGE.LIMIT_MAX = CONV_MAX_VOLTAGE_5V_CHANNEL;					// Maximum voltage limit setting
	channel_5v.voltage.enable_low_limit = 0;									// TODO: EEPROM
	channel_5v.voltage.enable_high_limit = 0;									// TODO: EEPROM
	
	// Current
	channel_5v.current_low_range.RANGE = 0;										// LOW current range
	channel_5v.current_low_range.setting = 4000;								// TODO: EEPROM
	channel_5v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	channel_5v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	channel_5v.current_low_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_5v.current_low_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_5v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_5v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_5v.current_low_range.enable_low_limit = 0;							// TODO: EEPROM
	channel_5v.current_low_range.enable_high_limit = 0;							// TODO: EEPROM
	
	channel_5v.current_high_range.RANGE = 1;									// HIGH current range
	channel_5v.current_high_range.setting = 4000;								// TODO: EEPROM
	channel_5v.current_high_range.MINIMUM = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	channel_5v.current_high_range.MAXIMUM = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	channel_5v.current_high_range.limit_low = CONV_HIGH_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_5v.current_high_range.limit_high = CONV_HIGH_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_5v.current_high_range.LIMIT_MIN = CONV_HIGH_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_5v.current_high_range.LIMIT_MAX = CONV_HIGH_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_5v.current_high_range.enable_low_limit = 0;							// TODO: EEPROM
	channel_5v.current_high_range.enable_high_limit = 0;						// TODO: EEPROM

	channel_5v.current = &channel_5v.current_low_range;
	
