zpq001/mdr32f9q-ps200w/src/converter.c
	//---------- Channel 12V -----------//
	
	// Common
	channel_12v.CHANNEL = CHANNEL_12V;
	channel_12v.load_state = LOAD_ENABLE;										
	channel_12v.overload_protection_enable = 1;									// TODO: EEPROM
	channel_12v.overload_timeout = 1;											// TODO: EEPROM
	
	// Voltage
	channel_12v.voltage.setting = 12000;										// TODO: EEPROM
	channel_12v.voltage.MINIMUM = CONV_MIN_VOLTAGE_12V_CHANNEL;					// Minimum voltage setting for channel
	channel_12v.voltage.MAXIMUM = CONV_MAX_VOLTAGE_12V_CHANNEL;					// Maximum voltage setting for channel
	channel_12v.voltage.limit_low = CONV_MIN_VOLTAGE_12V_CHANNEL;				// TODO: EEPROM
	channel_12v.voltage.limit_high = CONV_MAX_VOLTAGE_12V_CHANNEL;				// TODO: EEPROM
	channel_12v.VOLTAGE.LIMIT_MIN = CONV_MIN_VOLTAGE_12V_CHANNEL;				// Minimum voltage limit setting
	channel_12v.VOLTAGE.LIMIT_MAX = CONV_MAX_VOLTAGE_12V_CHANNEL;				// Maximum voltage limit setting
	channel_12v.voltage.enable_low_limit = 0;									// TODO: EEPROM
	channel_12v.voltage.enable_high_limit = 0;									// TODO: EEPROM
	
	// Current
	channel_12v.current_low_range.RANGE = 0;									// LOW current range
	channel_12v.current_low_range.setting = 2000;								// TODO: EEPROM
	channel_12v.current_low_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;			// Minimum current setting for specified current range
	channel_12v.current_low_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;			// Maximum current setting for specified current range
	channel_12v.current_low_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_12v.current_low_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_12v.current_low_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_12v.current_low_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_12v.current_low_range.enable_low_limit = 0;							// TODO: EEPROM
	channel_12v.current_low_range.enable_high_limit = 0;						// TODO: EEPROM
	
	// 12V channel cannot provide currents > 20A (low range)
	channel_12v.current_high_range.RANGE = 1;									// HIGH current range
	channel_12v.current_high_range.setting = 4000;								// TODO: EEPROM
	channel_12v.current_high_range.MINIMUM = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current setting for specified current range
	channel_12v.current_high_range.MAXIMUM = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current setting for specified current range
	channel_12v.current_high_range.limit_low = CONV_LOW_CURRENT_RANGE_MIN;		// TODO: EEPROM
	channel_12v.current_high_range.limit_high = CONV_LOW_CURRENT_RANGE_MAX;		// TODO: EEPROM
	channel_12v.current_high_range.LIMIT_MIN = CONV_LOW_CURRENT_RANGE_MIN;		// Minimum current limit setting
	channel_12v.current_high_range.LIMIT_MAX = CONV_LOW_CURRENT_RANGE_MAX;		// Maximum current limit setting
	channel_12v.current_high_range.enable_low_limit = 0;						// TODO: EEPROM
	channel_12v.current_high_range.enable_high_limit = 0;						// TODO: EEPROM

	channel_12v.current = &channel_12v.current_low_range;
	
	
	// Select default channel
	if (default_channel == CHANNEL_12V)
		regulation_setting_p = &channel_12v;
	else
		regulation_setting_p = &channel_5v;
	
	
	// Apply controls
	__disable_irq();
	SetFeedbackChannel(regulation_setting_p->CHANNEL);		// PORTF can be accessed from ISR
	__enable_irq();
	SetCurrentRange(regulation_setting_p->current->RANGE);
	SetOutputLoad(regulation_setting_p->load_state);
	apply_regulation();										// Apply voltage and current settings
}


/*
void Converter_Init(uint8_t default_channel)
{
	// Converter is powered off.
	// TODO: add restore from EEPROM
	
	// Common
	channel_5v.CHANNEL = CHANNEL_5V;
	channel_5v.load_state = LOAD_ENABLE;							// dummy - load at 5V channel can not be disabled
	// Voltage
	channel_5v.set_voltage = 5000;
	channel_5v.MAX_VOLTAGE = CONV_MAX_VOLTAGE_5V_CHANNEL;			// Maximum voltage setting for channel
	channel_5v.MIN_VOLTAGE = CONV_MIN_VOLTAGE_5V_CHANNEL;			// Minimum voltage setting for channel
	channel_5v.soft_max_voltage = 8000;
	channel_5v.soft_min_voltage = 3000;
	channel_5v.SOFT_MAX_VOLTAGE_LIMIT = 10000;						// Maximum soft voltage limit
	channel_5v.SOFT_MIN_VOLTAGE_LIMIT = 0;							// Minimum soft voltage limit
	channel_5v.soft_voltage_limits_enable = 0;
	// Current
	channel_5v.current_limit = CURRENT_LIM_LOW;
	channel_5v.set_current = 4000;
	channel_5v.LOW_LIM_MAX_CURRENT = CONV_LOW_LIM_MAX_CURRENT;		// Low limit (20A) maximum current setting
	channel_5v.LOW_LIM_MIN_CURRENT = CONV_MIN_CURRENT;				// Low limit (20A) min current setting
	channel_5v.HIGH_LIM_MAX_CURRENT = CONV_HIGH_LIM_MAX_CURRENT;	// High limit (40A) maximum current setting
	channel_5v.HIGH_LIM_MIN_CURRENT = CONV_MIN_CURRENT;				// High limit (40A) min current setting
	channel_5v.soft_max_current = 37000;
	channel_5v.soft_min_current = 30000;
	channel_5v.SOFT_MAX_CURRENT_LIMIT = 40000;						// Maximum soft current limit
	channel_5v.SOFT_MIN_CURRENT_LIMIT = 0;							// Minimum soft current limit
	channel_5v.soft_current_limits_enable = 0;
	
	
	
	// Common
	channel_12v.CHANNEL = CHANNEL_12V;
	channel_12v.load_state = LOAD_ENABLE;
	// Voltage
	channel_12v.set_voltage = 12000;
	channel_12v.MAX_VOLTAGE = CONV_MAX_VOLTAGE_12V_CHANNEL;			// Maximum voltage setting for channel
	channel_12v.MIN_VOLTAGE = CONV_MIN_VOLTAGE_12V_CHANNEL;			// Minimum voltage setting for channel
	channel_12v.soft_max_voltage = 16000;
	channel_12v.soft_min_voltage = 1500;
	channel_12v.SOFT_MAX_VOLTAGE_LIMIT = 20000;						// Maximum soft voltage limit
	channel_12v.SOFT_MIN_VOLTAGE_LIMIT = 0;							// Minimum soft voltage limit
	channel_12v.soft_voltage_limits_enable = 0;
	// Current
	channel_12v.current_limit = CURRENT_LIM_LOW;
	channel_12v.set_current = 2000;
	channel_12v.LOW_LIM_MAX_CURRENT = CONV_LOW_LIM_MAX_CURRENT;		// Low limit (20A) maximum current setting
	channel_12v.LOW_LIM_MIN_CURRENT = CONV_MIN_CURRENT;				// Low limit (20A) min current setting
	channel_12v.HIGH_LIM_MAX_CURRENT = CONV_LOW_LIM_MAX_CURRENT;	// High limit (40A) maximum current setting
	channel_12v.HIGH_LIM_MIN_CURRENT = CONV_MIN_CURRENT;			// High limit (40A) min current setting
	channel_12v.soft_max_current = 18000;
	channel_12v.soft_min_current = 6000;
	channel_12v.SOFT_MAX_CURRENT_LIMIT = 20000;						// Maximum soft current limit
	channel_12v.SOFT_MIN_CURRENT_LIMIT = 0;							// Minimum soft current limit
	channel_12v.soft_current_limits_enable = 0;
	
	// Select default channel
	if (default_channel == CHANNEL_12V)
		regulation_setting_p = &channel_12v;
	else
		regulation_setting_p = &channel_5v;
	
	
