zpq001/mdr32f9q-ps200w/src/converter.c
	// Apply controls
	__disable_irq();
	SetFeedbackChannel(regulation_setting_p->CHANNEL);		// PORTF can be accessed from ISR
	__enable_irq();
	SetCurrentLimit(regulation_setting_p->current_limit);
	SetOutputLoad(regulation_setting_p->load_state);
	apply_regulation();										// Apply voltage and current settings
}
*/




static uint32_t analyzeAndResetHWErrorState(void)
{
	uint32_t state_flags;
	if (state_HWProcess & STATE_HW_OVERLOADED)		
	{
		ctrl_HWProcess = CMD_HW_RESET_OVERLOAD;		
		while(ctrl_HWProcess);
		state_flags = CONV_OVERLOAD;	
	}
	// Add more if necessary
	else
	{
		state_flags = 0;
	}
	return state_flags;
}

static uint32_t disableConverterAndCheckHWState(void)
{
	uint32_t new_state;
	
#if CMD_HAS_PRIORITY == 1
	// If error status is generated simultaneously with OFF command,
	// converter will be turned off and no error status will be shown
	ctrl_HWProcess = CMD_HW_OFF | CMD_HW_RESET_OVERLOAD;	// Turn off converter and suppress error status (if any)
	while(ctrl_HWProcess);
	new_state = CONV_OFF;		
	
#elif ERROR_HAS_PRIORITY == 1
	// If error status is generated simultaneously with OFF command,
	// converter will be turned off, but error status will be indicated
	ctrl_HWProcess = CMD_HW_OFF;					// Turn converter off
	while(ctrl_HWProcess);
	new_state = CONV_OFF;	
	new_state |= analyzeAndResetHWErrorState();	
						
#endif
	return new_state;
}


uint8_t taskConverter_Enable = 0;

//---------------------------------------------//
//	Main converter task
//	
//---------------------------------------------//
void vTaskConverter(void *pvParameters) 
{
	conveter_message_t msg;
	
	uint8_t err_code;
	uint32_t adc_msg;
	uint32_t sound_msg;
	
	// Initialize
	xQueueConverter = xQueueCreate( 5, sizeof( conveter_message_t ) );		// Queue can contain 5 elements of type conveter_message_t
	if( xQueueConverter == 0 )
	{
		// Queue was not created and must not be used.
		while(1);
	}
	
	// Wait until task is started by dispatcher
	//vTaskSuspend(vTaskConverter);			
	
	while (taskConverter_Enable == 0)
		vTaskDelay(5);
	
	xQueueReset(xQueueConverter);
	
	
	while(1)
	{
		xQueueReceive(xQueueConverter, &msg, portMAX_DELAY);
	
		// CHECKME - Possibly need to add a mechanism to protect against illegal messages ?
		// For example, GUI sends message to set new voltage, but converter has switched channel by comand from UART.
		// In this case, command from GUI is old and bad and should be ignored somehow.

		switch (msg.type)
		{
			case CONVERTER_SET_VOLTAGE:
				regulation_setting_p->set_voltage = CheckSetVoltageRange(msg.data.a, &err_code);
				//----- Send notification to GUI -----//
				gui_msg = GUI_TASK_UPDATE_VOLTAGE_SETTING;
				xQueueSendToFront(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				if ((err_code == VCHECK_ABS_MAX) || (err_code == VCHECK_ABS_MIN))
					sound_msg = SND_CONV_SETTING_ILLEGAL;
				else if ((err_code == VCHECK_SOFT_MAX) || (err_code == VCHECK_SOFT_MIN))
					sound_msg = SND_CONV_SETTING_ILLEGAL;
				else
					sound_msg = SND_CONV_SETTING_OK;
				sound_msg |= SND_CONVERTER_PRIORITY_NORMAL;
				xQueueSendToBack(xQueueSound, &sound_msg, 0);
				break;
			case CONVERTER_SET_CURRENT:
				regulation_setting_p->set_current = CheckSetCurrentRange(msg.data.a, &err_code);
				//----- Send notification to GUI -----//
				gui_msg = GUI_TASK_UPDATE_CURRENT_SETTING;
				xQueueSendToFront(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				if ((err_code == CCHECK_ABS_MAX) || (err_code == CCHECK_ABS_MIN))
					sound_msg = SND_CONV_SETTING_ILLEGAL;
				else if ((err_code == CCHECK_SOFT_MAX) || (err_code == CCHECK_SOFT_MIN))
					sound_msg = SND_CONV_SETTING_ILLEGAL;
				else
					sound_msg = SND_CONV_SETTING_OK;
				sound_msg |= SND_CONVERTER_PRIORITY_NORMAL;
				xQueueSendToBack(xQueueSound, &sound_msg, 0);
				break;
			case CONVERTER_SET_VOLTAGE_LIMIT:
				// Apply new voltage limit
				
				//msg.voltage_limit_setting.mode
				//msg.voltage_limit_setting.enable
				//msg.voltage_limit_setting.value
				
				errCode =  Converter_SetVoltageLimit( msg.voltage_limit_setting.mode, 
													  (int32_t)msg.voltage_limit_setting.value, 
												      msg.voltage_limit_setting.enable);
				
		
				/*
				errCode = Converter_SetSoftLimit((int32_t)msg.data.b, regulation_setting_p, (uint8_t)msg.data.a);
				if (msg.data.a & 0x80000000)	// if limit enabled
				{
					regulation_setting_p.soft_voltage_limits_enable |= ((uint8_t)msg.data.a == 0x00) ? ENABLE_LOW_LIMIT : ENABLE_HIGH_LIMIT;
				}
				else
				{
					regulation_setting_p.soft_voltage_limits_enable &= ~((uint8_t)msg.data.a == 0x00) ? ENABLE_LOW_LIMIT : ENABLE_HIGH_LIMIT;
				} */
				//----- Send notification to GUI -----//
				gui_msg = GUI_TASK_UPDATE_SOFT_LIMIT_SETTINGS;
				xQueueSendToFront(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				
				// Apply limit settings to voltage
				regulation_setting_p->set_voltage = CheckSetVoltageRange(regulation_setting_p->set_voltage, 0);
				//----- Send notification to GUI -----//
				gui_msg = GUI_TASK_UPDATE_VOLTAGE_SETTING;
				xQueueSendToFront(xQueueGUI, &gui_msg, 0);
				//------------------------------------//
				
				// Apply voltage and current settings
				apply_regulation();		
				
				if ((err_code == SLIM_MAX) || (err_code == SLIM_MIN))
					sound_msg = SND_CONV_SETTING_ILLEGAL;
				else
					sound_msg = SND_CONV_SETTING_OK;
				sound_msg |= SND_CONVERTER_PRIORITY_NORMAL;
				xQueueSendToBack(xQueueSound, &sound_msg, 0);
				break;
		}
		

		
		switch(conv_state & CONV_STATE_MASK)
		{
			case CONV_OFF:
				if (msg.type == CONVERTER_SWITCH_TO_5VCH)
				{
					regulation_setting_p = &channel_5v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (msg.type == CONVERTER_SWITCH_TO_12VCH)
				{
					regulation_setting_p = &channel_12v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (msg.type == SET_CURRENT_LIMIT_20A)
				{
					regulation_setting_p -> current_limit = CURRENT_LIM_LOW;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_CURRENT_LIMIT;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (msg.type == SET_CURRENT_LIMIT_40A)
				{
					regulation_setting_p -> current_limit = CURRENT_LIM_HIGH;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_CURRENT_LIMIT;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (msg.type == CONVERTER_TURN_OFF)
				{
					conv_state = CONV_OFF;			// Reset overload flag
					break;
				}
				if (msg.type == CONVERTER_TURN_ON)
				{
					// Message to turn on converter is received
					if ((state_HWProcess & STATE_HW_TIMER_NOT_EXPIRED) || (!(state_HWProcess & STATE_HW_USER_TIMER_EXPIRED)))
					{
						// Safe timeout is not expired
						break;
					}
					ctrl_HWProcess = CMD_HW_ON;
					while(ctrl_HWProcess);
					conv_state = CONV_ON;			// Switch to new state and reset overload flag
					break;
				}
				break;
			case CONV_ON:
				if (msg.type == CONVERTER_TURN_OFF)
				{
					conv_state = disableConverterAndCheckHWState();
					break;
				}
				if ( (msg.type == CONVERTER_SWITCH_TO_5VCH) && (regulation_setting_p != &channel_5v) )
				{
					conv_state = disableConverterAndCheckHWState();
					vTaskDelay(4);
					regulation_setting_p = &channel_5v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if ( (msg.type == CONVERTER_SWITCH_TO_12VCH) && (regulation_setting_p != &channel_12v) )
				{
					conv_state = disableConverterAndCheckHWState();
					vTaskDelay(4);
					regulation_setting_p = &channel_5v;
					ctrl_HWProcess = CMD_HW_RESTART_USER_TIMER;
					//----- Send notification to GUI -----//
					gui_msg = GUI_TASK_UPDATE_FEEDBACK_CHANNEL;
					xQueueSendToFront(xQueueGUI, &gui_msg, 0);
					//------------------------------------//
					while(ctrl_HWProcess);
					break;
				}
				if (state_HWProcess & STATE_HW_OFF)
				{
					// Some hardware error has happened and converter had been switched off
					conv_state = CONV_OFF;
					conv_state |= analyzeAndResetHWErrorState();
					if (conv_state & CONV_OVERLOAD)
					{
						// Send message to sound driver
						// TODO: send this message in other cases (when overload is detected simultaneously with button)
						sound_msg = SND_CONV_OVERLOADED | SND_CONVERTER_PRIORITY_HIGHEST;
						xQueueSendToBack(xQueueSound, &sound_msg, 0);
					}
					break;
				}
				break;
		}
		
		
